; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v8 - type_2 ?v4 - type_3)
 	      (pred_2 ?v5 - object ?v4 - type_3)
	      (pred_4 ?v8 - type_2 ?v2 - type_1)
	      (pred_3 ?v8 - type_2 ?v5 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v8 - type_2 ?v3 ?v7 - type_3)
       :precondition (and  (pred_1 ?v8 ?v3))
       :effect (and  (pred_1 ?v8 ?v7)
		     (not (pred_1 ?v8 ?v3))))

   (:action op_2
       :parameters (?v8 - type_2 ?v6 - object ?v1 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v1) (pred_1 ?v8 ?v1) (pred_4 ?v8 ?v2))
       :effect (and (pred_3 ?v8 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v1)) 
		    (not (pred_4 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_2 ?v6 - object ?v1 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v6 ?v2) (pred_1 ?v8 ?v1))
       :effect (and (pred_2 ?v6 ?v1)
		    (pred_4 ?v8 ?v2)
		    (not (pred_3 ?v8 ?v6 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_09 obj_08 - type_1
obj_06 obj_01 obj_07 - type_3
obj_03 obj_02 obj_05 - object)
(:init
(pred_1 obj_04 obj_01)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_08)
(pred_2 obj_03 obj_06)
(pred_2 obj_02 obj_06)
(pred_2 obj_05 obj_06)
)
(:goal
(and
(pred_2 obj_03 obj_01)
(pred_2 obj_02 obj_06)
(pred_2 obj_05 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_04 ?b obj_08))))
)
)

; plan
1. (op_1 obj_04 obj_01 obj_06)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_06)
   goals met: 1 of 3
2. (op_2 obj_04 obj_03 obj_06 obj_09)
   deleted: (pred_2 obj_03 obj_06) (pred_4 obj_04 obj_09)
   added: (pred_3 obj_04 obj_03 obj_09)
   goals met: 1 of 3
3. (op_1 obj_04 obj_06 obj_01)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_01)
   goals met: 1 of 3
4. (op_3 obj_04 obj_03 obj_01 obj_09)
   deleted: (pred_3 obj_04 obj_03 obj_09)
   added: (pred_2 obj_03 obj_01) (pred_4 obj_04 obj_09)
   goals met: 2 of 3
5. (op_1 obj_04 obj_01 obj_06)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_06)
   goals met: 2 of 3
6. (op_2 obj_04 obj_05 obj_06 obj_09)
   deleted: (pred_2 obj_05 obj_06) (pred_4 obj_04 obj_09)
   added: (pred_3 obj_04 obj_05 obj_09)
   goals met: 2 of 3
7. (op_1 obj_04 obj_06 obj_07)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_07)
   goals met: 2 of 3
8. (op_3 obj_04 obj_05 obj_07 obj_09)
   deleted: (pred_3 obj_04 obj_05 obj_09)
   added: (pred_2 obj_05 obj_07) (pred_4 obj_04 obj_09)
   goals met: 3 of 3
